{
 "İman ve İbadet": [
    {
    "id": "1",
    "text": "Peygamber (s.a.v.) şöyle buyurdu: 'Allah'a ve ahiret gününe inanan kişi, günde beş vakit namaz kılmalıdır.'",
    "source": "Sahih Bukhari, Kitab 2, Hadis 21"
    },
    {
      "id": "2",
      "text": "The Prophet (peace be upon him) said: 'The best of you is the one who learns the Quran and teaches it.'",
      "source": "Sahih Bukhari, Book 3, Hadith 61"
    },
    
    {
  "id": "3",
  "text": "The Prophet (peace be upon him) said: 'The supplication of a Muslim for his brother in his absence is readily accepted. An angel is appointed to his side. Whenever he makes a beneficial supplication for his brother the appointed angel says, 'Ameen. And may you also be blessed with the same.''",
  "source": "Sahih Muslim, Book 35, Hadith 6588"
    },
    {
      "id": "4",
      "topic": "Prayer",
      "text": "The Prophet (peace be upon him) said: 'The first thing that a person will be asked about on the Day of Judgment is their prayer. If it is complete, then the rest of their deeds will be considered complete. If it is not, then the rest of their deeds will not make up for it.'",
      "source": "Sunan al-Tirmidhi, Book 1, Hadith 194"
    },
    {
      "id": "5",
      "topic": "Fasting",
      "text": "The Prophet (peace be upon him) said: 'Fasting is a shield from Hellfire, just like the shield of any of you in battle.'",
      "source": "Sahih Bukhari, Book 31, Hadith 118"
    }

    


    
  ],
  
  "Character and Ethics": [
    {
      "id": "1",
      "text": "The Prophet (peace be upon him) said: 'The most perfect believer in faith is the one who is best in moral character.'",
      "source": "Sunan Ibn Majah, Book 1, Hadith 75"
    },
    {
      "id": "2",
      "text": "The Prophet (peace be upon him) said: 'Do not be people without minds of your own, saying that if others treat you well you will treat them well, and that if they do wrong you will do wrong. Instead, accustom yourselves to do good if people do good and not to do wrong if they do evil.'",
      "source": "Sunan al-Tirmidhi, Book 47, Hadith 3315"
    },
    {
  "id": "3",
  "text": "The Prophet (peace be upon him) said: 'The strongest among you is the one who controls his anger.'",
  "source": "Sahih al-Bukhari, Book 73, Hadith 135"
    },
    {
      "id": "4",
      "text": "The Prophet (peace be upon him) said: 'None of you truly believes until he loves for his brother what he loves for himself.'",
      "source": "Sahih al-Bukhari, Book 13, Hadith 1"
    },
     {
      "id": "5",
      "topic": "Truthfulness",
      "text": "The Prophet (peace be upon him) said: 'Be truthful, for verily truth leads to righteousness, and righteousness leads to Paradise. And a man keeps on telling the truth until he becomes a truthful person. Falsehood leads to wickedness and wickedness leads to Hellfire. And a man keeps on telling lies until he is written as a liar with Allah.'",
      "source": "Sahih Bukhari, Book 73, Hadith 116"
    },
    {
      "id": "6",
      "topic": "Generosity",
      "text": "The Prophet (peace be upon him) said: 'The best charity is that which is practiced by a wealthy person. And start giving first to your dependents.'",
      "source": "Sahih Bukhari, Book 24, Hadith 507"
    },
    {
      "id": "7",
      "topic": "Forgiveness",
      "text": "The Prophet (peace be upon him) said: 'The best among you are those who have the best manners and character.'",
      "source": "Sahih Bukhari, Book 56, Hadith 759"
    },
     {
      "id": "8",
      "topic": "Truthfulness",
      "text": "The Prophet (peace be upon him) said: 'Truthfulness leads to righteousness, and righteousness leads to Paradise. And a man keeps on telling the truth until he becomes a truthful person. Falsehood leads to wickedness, and wickedness leads to Hellfire. And a man keeps on telling lies until he is recorded as a liar.'",
      "source": "Sahih Bukhari, Book 73, Hadith 116"
    },
    {
      "id": "9",
      "topic": "Patience",
      "text": "The Prophet (peace be upon him) said: 'No one is given a better or more abundant gift than patience.'",
      "source": "Sahih Bukhari, Book 70, Hadith 548"
    }




    
   
  ],

  "Family and Society":[
      {
        "id": "1",
        "text": "The Prophet (peace be upon him) said: 'He who believes in Allah and the Last Day should honor his neighbor.'",
        "source": "Sahih al-Bukhari, Book 78, Hadith 601"
      },
     {
      "id": "2",
      "text": "The Prophet (peace be upon him) said: 'The most perfect believer in faith is the one who is best in moral character and the best among you are those who are best to their wives.'",
      "source": "Sunan Ibn Majah, Book 9, Hadith 1978"
    },
    {
      "id": "3",
      "topic": "Kindness to Parents",
      "text": "The Prophet (peace be upon him) said: 'Paradise lies at the feet of your mother.'",
      "source": "Sunan Ibn Majah, Book 1, Hadith 69"
    }
   
      
    
  ]



  
  
}
